{
    "status": "ok",
    "totalResults": 19,
    "articles": [
        {
            "source": {
                "id": null,
                "name": "CBS Sports"
            },
            "author": "Jared Dubin",
            "title": "Rams vs. Titans score: Live updates, highlights, game stats, TV, NFL live stream for 'Sunday Night Football' - CBSSports.com",
            "description": "Live scores, highlights and updates from the Rams vs. Titans game",
            "url": "https://www.cbssports.com/nfl/news/rams-vs-titans-score-live-updates-highlights-game-stats-tv-nfl-live-stream-for-sunday-night-football/live/",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2019/07/19/02d92b0b-20f4-4ec7-be49-6426acfc0897/thumbnail/1200x675/edc903d69ca53adf4eeb3af327f98e85/los-angeles-rams-helmet.jpg",
            "publishedAt": "2021-11-08T02:31:00Z",
            "content": "The Tennessee Titans intercepted Matthew Stafford two times in 26 seconds, and used that sequence to jump out to a surprising lead on the road against the Los Angeles Rams. Stafford's first-half stru… [+1040 chars]",
            "full_content": "So much for the Rams proving in prime time that they belong atop the list of Super Bowl contenders. Los Angeles played host to \"Sunday Night Football\" in Week 9, but Sunday's prime-time affair belonged almost exclusively to the visiting Titans. While Ryan Tannehill and an offense featuring Adrian Peterson among fill-ins for the injured Derrick Henry did not always explode, Tennessee's defense definitely did, with Jeffery Simmons and Co. disrupting Matthew Stafford early and often to headline a 28-16 rout at SoFi Stadium.\n\nTennessee has now won five straight to improve to 7-2, perhaps solidifying itself as the new favorite in the AFC. The Rams, meanwhile, are now 7-2 and officially behind the red-hot Cardinals in the NFC West.\n\nHere are some immediate takeaways from Sunday night's big Titans win:\n\nWhy the Titans won\n\nOn a night that started feisty and physical on both sides, they were opportunistic amid the early punches: after a deep-ball pick prematurely ended their first drive, they held the Rams to a field goal and then, a few series later, forced Stafford into back-to-back interceptions deep in his own territory. Simmons wrecked things up front, rattling Stafford out of the gate, while Denico Autry and Harold Landry also stepped up to collapse the pocket. The front-seven heat took pressure off a secondary that had surprisingly little trouble containing Cooper Kupp and Co. for much of the night. And offensively, while Tannehill and their post-Henry running game lacked pizzazz, they successfully grinded it out when they needed to, outmuscling L.A. throughout the evening.\n\nWhy the Rams lost\n\nStafford has been an MVP candidate all year, headlining the Rams' high-flying attack, but against the Titans, he looked an awful lot like the guy who spent so many years ducking and covering and forcing things in Detroit. His protection was poor, no doubt, with Austin Corbett and the Rams' interior frequently folding at the will of Simmons and the rest of Mike Vrabel's front. But the QB wasn't great himself, either, missing open downfield shots and throwing a pair of really ill-advised passes that ended up giving Tennessee the turnover advantage. Kupp and Robert Woods showed up too late (as did Sean McVay's fourth-down play-calling), and the run game didn't really make a difference. Defensively, Aaron Donald and Jalen Ramsey did their usual thing, but penalties and perhaps a shade of indifference left them vulnerable in the final stages of the game, too.\n\nTurning point\n\nAs soon as Stafford threw a pick-six, the Titans actually appeared poised to win this. The Rams led 3-0 when Stafford was first picked off, with David Long Jr. nabbing his throw and setting up a quick Geoff Swaim score. Trailing 7-3, though, on the first play of the ensuing drive, he inexplicably fired a short one toward Woods with multiple cover men in the area, and Kevin Byard had no problem returning the pick 24 yards for the score. The 14-3 hole proved too deep to overcome.\n\nPlay of the game\n\nIt has to be the play in which Stafford got whipped around and pulled a Carson Wentz, gifting a pick to the opponent near his own end zone -- a play that defined a night full of Titans-led disruptions:\n\nWhat's next\n\nThe Titans (7-2) will return home in Week 10 after their big prime-time win, this time to face the Saints (5-3), who just lost a narrow one to the Falcons. The Rams (7-2), meanwhile, will hit the road for an important NFC West showdown with the 49ers (3-5), who just fell to the Cardinals, on \"Monday Night Football.\""
        },
        {
            "source": {
                "id": "usa-today",
                "name": "USA Today"
            },
            "author": "Jorge L. Ortiz, John Bacon, Celina Tebor",
            "title": "'Pure chaos': Criminal investigation launched after 8 killed at Astroworld Festival in Houston - USA TODAY",
            "description": "A criminal investigation is underway that killed at least eight people at the Astroworld Festival in Houston on Friday, officials confirmed.",
            "url": "https://www.usatoday.com/story/entertainment/music/2021/11/07/astroworld-festival-tragedy-criminal-investigation/6329755001/",
            "urlToImage": "https://www.gannett-cdn.com/presto/2021/11/06/USAT/5e80d9d9-3ffe-459e-b26b-fa3c29bcf162-VPC_ASTROWORLD_desk.jpeg?crop=1274,717,x5,y0&width=1274&height=717&format=pjpg&auto=webp",
            "publishedAt": "2021-11-08T01:47:31Z",
            "content": "A criminal investigation is underway after the crowd at a Houston music festival on Friday suddenly surged toward the stage during a performance by rapper Travis Scott, killing at least eight people,… [+6135 chars]",
            "full_content": "A criminal investigation is underway after the crowd at a Houston music festival on Friday suddenly surged toward the stage during a performance by rapper Travis Scott, killing at least eight people, officials confirmed Sunday.\n\nHouston Mayor Sylvester Turner told CNN's Pamela Brown on Sunday that his team met to begin reviewing what happened at the concert. The investigation \"will take weeks, if not longer,\" he said.\n\nAround 50,000 people were in attendance at Scott's music festival, which started in 2018. As a timer clicked down to start the rapper's performance, concertgoers pushed toward the stage at NRG Park in Houston, crowding the stage and leaving little room to move.\n\nThe crowd surge left at least eight people dead and scores injured.\n\nWitnesses described a complete security collapse at the venue. . The crowd at the two-day event that opened Friday was \"out of control\" before the show ever opened, said concertgoer Julius Tlacuapa.\n\nAnother witness, Reese Bludau, told CNN that the concert \"was pure chaos.\" He said his height allowed him to stand above the crowds and breathe fresh air, but shorter people would have been crushed and unable to breathe easily.\n\nBludau said he heard strong chants of \"stop the show\" and \"help us\" from the crowd between songs. “I just told myself to stay calm,\" he added.\n\nThe Harris County Medical Examiner is expected to release on Monday the names of all the victims killed at Friday's concert.\n\nThe victims ranged in age between 14 and 27. Twenty-five people were taken to a hospital, Turner said Saturday, and 13 remained there. They included a 10-year-old in critical condition, officials said.\n\n'They were not breathing': Astroworld survivors recount bodies trampled, overwhelmed security\n\nTurner told CNN said this year's security was \"beefed up\" compared to previous Astroworld festivals. There were over 500 Houston police officers and 700 private security officers in attendance, he said. But the increased security ultimately proved futile.\n\n“It may well be that this tragedy is the result of unpredictable events, of circumstances coming together that couldn’t possibly have been avoided,” said Judge Lina Hidalgo, Harris County’s top elected official. “But until we determine that, I will ask the tough questions.”\n\nContemporary Services Corp., headquartered in Los Angeles, was responsible for security staff at the festival, according to county records in Texas. Representatives for the company – which advertises online as being “recognized worldwide as the pioneer, expert and only employee owned company in the crowd management field” – did not immediately respond to emails and phone messages seeking comment.\n\nHouston police and fire department officials said their investigation will include reviewing video taken by concert promoter Live Nation, as well as dozens of clips from people at the show.\n\nOfficials also planned to review the event’s security plan and various permits issued to organizers to see whether they were properly followed. In addition, investigators planned to speak with Live Nation representatives, Scott and concertgoers.\n\nExperts who have studied deaths caused by crowd surges say they are often a result of density – too many people packed into a small space. The crowd is often running either away from a perceived threat or toward something they want, such as a performer, before hitting a barrier.\n\nG. Keith Still, a visiting professor of crowd science at the United Kingdom’s University of Suffolk, has testified as an expert witness in court cases involving crowds. He said he usually does not look at eyewitness reports in the early stages of analyzing an incident because emotions can cloud the picture, and witnesses can see only what’s immediately around them.\n\nBased on fire codes, the venue could have held 200,000 people, but city officials limited the attendance to 50,000, Houston Fire Chief Samuel Peña said.\n\n“It was the crowd control at the point of the stage that was the issue, especially as the crowd began to surge toward the stage,” Peña said.\n\nAlso Sunday, one of the first of many expected lawsuits was filed on behalf of a man injured in the crush of people in state court in Houston. Attorneys for Manuel Souza sued Scott, Live Nation and others, saying they were responsible.\n\nScott, an eight-time Grammy-nominated rapper and Houston native, released a statement expressing his sorrow over Friday's events.\n\n\"I am absolutely devastated by what took place last night,\" the rapper, a native of Houston, wrote on Twitter. \"My prayers go out to the families and all those impacted by what happened at Astroworld Festival. Houston PD has my total support as they continue to look into the tragic loss of life.\"\n\nKylie Jenner, who shares 3-year-old daughter Stormi with Scott and is expecting their second child, spoke out on her Instagram Stories, writing that she and Scott were \"broken and devastated.\"\n\n\"My thoughts and prayers are will all who lost their lives, were injured or affected in anyway (sic) by yesterday's events,\" she wrote. \"And also for Travis who I know cares deeply for his fans and the Houston community.\"\n\n'Weren't aware':Kylie Jenner says she, Travis Scott didn't know about Astroworld deaths\n\nThe list of victims will include Rodolfo Angel Peña, 23, an aspiring model and psychology student from Laredo, Texas. His older brother, Guadalupe Peña, said authorities told the family his brother died of cardiac arrest.\n\n\"He’s a real strong person,\" Guadalupe Peña told USA TODAY. \"I know he would have gotten out of it. It seems real sketchy how it happened.\"\n\nThe promoter behind the Astroworld Festival has been cited for safety issues in the past by the Occupational Safety and Health Administration, records show. Live Nation Entertainment, the largest live music promoter in the world, has been fined or sued for issues ranging from unruly crowds to equipment failures at various venues and concerts in the past decade.\n\nAstroworld Festival victims:Teens, college students and at least one aspiring model\n\nLive Nation Entertainment and singer Gwen Stefani were sued in federal court by Lisa Keri Stricklin for injuries she suffered during a 2016 concert at the PNC Pavilion in Charlotte, North Carolina.\n\nAccording to the court complaint, concert patrons were initially seated in a reserved section and lawn seats. During the concert, Stefani made an impromptu announcement that patrons in the lawn seats could move to the reserve section and “fill in anywhere you like.”\n\n“This announcement created a stampede of patrons … with many patrons knocking over and breaching the security barricades,” the lawsuit alleged.\n\nStricklin alleged that she was “trampled by the rush of patrons,” resulting in severe physical injuries, including a broken leg. Attorneys for all parties in the lawsuit signed a stipulation of dismissal on March 12, 2019, a move that typically signals an out-of-court settlement that ends a case.\n\nIn 2019, the company was fined $5,350 for an accident in which an employee walking near a staging area was struck in the head by a six-foot metal post. The company also was penalized $4,250 in a settlement for a 2011 accident in which an employee working as a rigger had a finger crushed while working to remove a cable. The finger was later amputated.\n\nContributing: Rick Jervis Elise Brisco, Kevin McCoy and Melissa Ruggieri, USA TODAY; The Associated Press"
        },
        {
            "source": {
                "id": "bleacher-report",
                "name": "Bleacher Report"
            },
            "author": "Erin Walsh",
            "title": "Odell Beckham Jr. Rumors: WR Wants to Join Seahawks, Prefers Free Agency over Waivers - Bleacher Report",
            "description": "Cleveland Browns wide receiver Odell Beckham Jr. will be placed on waivers Monday, and it sounds like he's keen on teaming up with Russell Wilson.  Pro...",
            "url": "https://bleacherreport.com/articles/10017502-odell-beckham-jr-rumors-wr-wants-to-join-seahawks-prefers-free-agency-over-waivers",
            "urlToImage": "https://media.bleacherreport.com/image/upload/v1636333827/f5t9niyoykpssgahgaes.jpg",
            "publishedAt": "2021-11-08T01:23:55Z",
            "content": "AP Photo/Kirk Irwin\r\nCleveland Browns wide receiver Odell Beckham Jr. will be placed on waivers Monday, and it sounds like he's keen on teaming up with Russell Wilson. \r\nPro Football Talk's Mike Flor… [+1953 chars]",
            "full_content": "AP Photo/Kirk Irwin\n\nCleveland Browns wide receiver Odell Beckham Jr. will be placed on waivers Monday, and it sounds like he's keen on teaming up with Russell Wilson.\n\nPro Football Talk's Mike Florio Beckham reported during the Sunday Night Football pregame broadcast that Beckham prefers to become a free agent and wants to join the Seattle Seahawks. Florio added that the San Francisco 49ers and New Orleans Saints are also considered \"teams to watch.\"\n\nThe Seahawks can place a claim for Beckham. However, the team is ninth in the NFL waiver-claiming order, meaning any team above them that submits a claim for the star receiver would have priority. Seattle might have a better chance to land him if he were to become a free agent.\n\nIf Beckham were to join the Seahawks, Seattle would boast one of the best receiving groups in the NFL with DK Metcalf and Tyler Lockett already onboard.\n\nThe 29-year-old averaged 13.6 yards per reception in six games with the Browns this year and is averaging 14 yards per catch in his eight NFL seasons. However, his longest catch this season is just 26 yards.\n\nSeattle is currently out of the playoff picture with a 3-5 record, and Beckham wants to join a contender. However, the team has been without Wilson since Week 5 with a finger injury, and he reportedly might be ready for a Week 10 clash against the Green Bay Packers. Wilson's return and the addition of OBJ could be enough to vault the Seahawks back into playoff contention.\n\nBeckham's fallout with the Browns was sped up after his father, Odell Beckham Sr., posted a video on Instagram highlighting times quarterback Baker Mayfield didn't throw the ball to his son or missed him when he was open.\n\nBeckham never reached out to Mayfield to apologize and was later excused from Browns practices as head coach Kevin Stefanski told players the receiver was essentially not part of the team anymore.\n\nThe LSU product also reportedly asked to be traded multiple times during the offseason and after last week's loss to the Pittsburgh Steelers, per Mary Kay Cabot of Cleveland.com. So, it's no surprise he's on the move for the second time in his career."
        },
        {
            "source": {
                "id": null,
                "name": "The Guardian"
            },
            "author": "Ed Pilkington",
            "title": "Virginia victory gives some Republicans glimpse of future without Trump - The Guardian",
            "description": "Liz Cheney and Chris Christie lead calls to move on from 2020 after Glenn Youngkin’s ‘Trump-lite’ election win",
            "url": "https://amp.theguardian.com/us-news/2021/nov/07/virginia-republicans-trump-cheney-christie-scott-youngkin",
            "urlToImage": "https://i.guim.co.uk/img/media/f0fc6b6a9cc93d2f0e97c83bee27266c13cbc7a3/0_227_3027_1817/master/3027.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=de391b97858a16e6544161211a7598b5",
            "publishedAt": "2021-11-08T00:58:00Z",
            "content": "Prominent Republicans are seizing on the victory of Glenn Youngkin in the Virginia gubernatorial race last week to call for a realignment of the party that would move beyond Donald Trump and his big … [+5144 chars]",
            "full_content": "Prominent Republicans are seizing on the victory of Glenn Youngkin in the Virginia gubernatorial race last week to call for a realignment of the party that would move beyond Donald Trump and his “big lie” that the 2020 election was stolen.\n\nWhile most Republicans remain either in lockstep with, or silent about, the former president’s campaign of misinformation surrounding his defeat by Joe Biden, a number of voices have begun tentatively to argue for a reboot.\n\nLiz Cheney, the Wyoming representative ousted from the No 3 leadership position in May over her resistance to Trump’s lies, told Fox News Sunday her party needed to change tack. She said that it was imperative for the wellbeing of the US that it had two strong parties.\n\n“The only way the Republican party can go forward in strength is if we reject what happened on 6 January,” she said. “If we reject the efforts that President Trump made frankly to steal the election, and if we tell voters the truth.\n\n“In order to win elections we have to remember that the most conservative of ideals is embracing the constitution and the rule of law.”\n\nCheney was also asked about attempts, notably by Tucker Carlson of Fox News, to divert blame for the deadly attack on the US Capitol away from the Trump supporters who sought to overturn his election defeat.\n\n“It’s the same thing that you hear people saying 9/11 is an inside job,” she said. “It’s un-American to be spreading those kinds of lies, and they are lies.”\n\nWe can no longer talk about the past and the past elections – no matter where you stand on that issue\n\nCheney’s comments came a day after Chris Christie, a former governor of New Jersey and candidate for the Republican presidential nomination, made an impassioned plea to the Republican Jewish Coalition conference in Las Vegas.\n\nChristie, a longtime confidant of Trump, nonetheless called for the party to move beyond the former president’s obsession with the last election.\n\n“We can no longer talk about the past and the past elections – no matter where you stand on that issue, no matter where you stand, it is over,” he said.\n\nHe added: “Every minute that we spend talking about 2020 – while we’re wasting time doing that, Joe Biden, Kamala Harris, Nancy Pelosi and Chuck Schumer are laying ruin to this country. We better focus on that and take our eyes off the rearview mirror and start looking through the windshield again.”\n\nYoungkin defeated a former Democratic governor, Terry McAuliffe, in a bitter contest in which the issue of race in education was pivotal. The Republican assiduously avoided anything to do with Trump in his pitch to Virginian voters.\n\nBut he did run a campaign that borrowed heavily from Trump’s tactics, not least his use of dog-whistles to drive a wedge between white suburbanites and Democrats and his willingness to exploit falsehoods and misinformation. Youngkin ran heavily on his opposition to critical race theory, an academic discipline that examines the ways in which racism operates in US laws and society, saying he would ban its use in Virginia schools. It is not taught in a single Virginia school.\n\nTrumpism without Trump appears to be gaining ground among Republicans in the wake of Youngkin’s success in a state that has been trending Democratic. But with Trump hinting at another bid for the White House, and with his threat still hanging over the party that he will endorse primary challengers to anyone who defies him, many Republicans continue to act with extreme timidity, for fear that they too will be ousted.\n\nI think you’d be foolish not to want and accept Donald Trump’s endorsement\n\nRick Scott, chair of the National Republican Senatorial Committee, chose his words carefully on NBC’s Meet the Press on Sunday.\n\nHe began by saying that Trump’s endorsement was welcome.\n\n“We would love Donald Trump’s endorsement. If you’re a Republican, you want his endorsement.”\n\nBut he then emphasised that candidates should campaign on issues.\n\n“I think you’d be foolish not to want and accept Donald Trump’s endorsement. But you’re going to win not because somebody endorses you, you’re going to win because you focus on making sure inflation gets stopped, making sure people get a job, making sure your kids aren’t indoctrinated on critical race theory. That’s going to be the issues that people care about.”\n\nLarry Hogan, the Republican governor of Maryland and a frequent critic of Trump, was unsurprisingly more outspoken.\n\nSpeaking to CNN’s State of the Union, he said the lesson of Youngkin’s win was that “voters want to hear more about what you are going to do for them, rather than what you want to say for or against the former president”.\n\nHogan said he was concerned about the damage Trump could do in the presidential race in 2024, should he continue to use his power of endorsement to promote extremist Republican candidates.\n\n“If the former president interferes with primaries and tries to nominate people who are unelectable in the swing and purple states,” he said, “that’s going to hurt”.\n\nHogan added: “Trump is likely not going away. But if the Republican party wants to be successful at winning elections I agree with Governor Christie, we can’t look back and constantly re-litigate what happened in 2020, we have to look to ’22 and ’24.\n\n“We have to have a message that appeals to more people that’s not about the former president.”"
        },
        {
            "source": {
                "id": null,
                "name": "Benzinga"
            },
            "author": "Michael Cohen",
            "title": "Tesla CEO Elon Musk Proposes Selling 10% Of His Company Stock, He's Asking Twitter Followers To Decide - Benzinga",
            "description": "Elon Musk on Saturday sent a tweet in which he proposed selling 10% of his Tesla Inc (NASDAQ: TSLA) stock, and asked his followers to vote on his ...",
            "url": "https://www.benzinga.com/news/21/11/23938749/tesla-ceo-elon-musk-proposes-selling-10-of-his-company-stock-hes-asking-twitter-followers-to-decide",
            "urlToImage": "https://cdn.benzinga.com/files/imagecache/og_image_social_share_1200x630/images/story/2012/elon-musk-6222396_1920_3.jpg",
            "publishedAt": "2021-11-08T00:48:50Z",
            "content": "Elon Musk on Saturday sent a tweet in which he proposed selling 10% of his Tesla Inc (NASDAQ: TSLA) stock, and asked his followers to vote on his decision.\r\nWhat Happened: The Tesla CEO was referenci… [+1569 chars]",
            "full_content": "Elon Musk on Saturday sent a tweet in which he proposed selling 10% of his Tesla Inc (NASDAQ: TSLA) stock, and asked his followers to vote on his decision.\n\nWhat Happened: The Tesla CEO was referencing a proposal in the U.S. Senate to tax the richest Americans in an effort to pay for social safety net and climate change policies. The plan would tax billionaires on the unrealized gains in the value of their liquid assets, such as stocks, bonds and cash. Musk responded in a tweet.\n\nMuch is made lately of unrealized gains being a means of tax avoidance, so I propose selling 10% of my Tesla stock. Do you support this? — Elon Musk (@elonmusk) November 6, 2021\n\nMusk followed up with a second tweet about 10 minutes later, explaining why selling his Tesla stock would be his way of paying such a tax.\n\nNote, I do not take a cash salary or bonus from anywhere. I only have stock, thus the only way for me to pay taxes personally is to sell stock. — Elon Musk (@elonmusk) November 6, 2021\n\nAt the time of publication, 55.6% supported Musk selling his stock, while 44.4% opposed the idea.\n\nWhy It Matters: The tax would be levied on those with more than $1 billion in assets or more than $100 million in income for three consecutive years, that's about 700 people in the United States. Included in that group are Musk, Meta Platforms Inc (NASDAQ: FB) founder Mark Zuckerberg, and Amazon.Com Inc (NASDAQ: AMZN) founder Jeff Bezos.\n\nThe legislation would initially impose a capital gains tax of 23.8 percent on the increase in value of billionaires’ tradable assets based on the original price of those assets.\n\nRelated Link: Why Paul Krugman Accuses Elon Musk Of An 'Insecure Ego'"
        },
        {
            "source": {
                "id": "the-hill",
                "name": "The Hill"
            },
            "author": "Olafimihan Oshin",
            "title": "Granholm says Biden 'looking at' tapping strategic reserve as fuel prices rise | TheHill - The Hill",
            "description": "Energy Secretary Jennifer Granholm (D) said Sunday that President...",
            "url": "https://thehill.com/policy/energy-environment/580480-granholm-says-biden-looking-at-tapping-strategic-reserve-as-fuel",
            "urlToImage": "https://thehill.com/sites/default/files/ca_jennifergranholm_getty.jpg",
            "publishedAt": "2021-11-08T00:47:58Z",
            "content": "Energy Secretary Jennifer GranholmJennifer GranholmGranholm touts 'really exciting' provision in infrastructure bill at COP26 World's energy ministers to convene in Pittsburgh next year Overnight Ene… [+2184 chars]",
            "full_content": "Energy Secretary Jennifer Granholm Jennifer GranholmGranholm touts 'really exciting' provision in infrastructure bill at COP26 World's energy ministers to convene in Pittsburgh next year Overnight Energy & Environment — Presented by The American Petroleum Institute — Biden official defends 'carrots'-based approach MORE (D) said Sunday that President Biden Joe BidenVirginia loss lays bare Democrats' struggle with rural voters After victory, Biden seeks political rebound Sunday shows preview: House passes bipartisan infrastructure bill; Democrats suffer election loss in Virginia MORE is considering tapping into the nation’s Strategic Petroleum Reserve amid rising crude oil prices.\n\nDuring an appearance on CNN’s “State of the Union,” Granholm told host Dana Bash Dana BashFive things to watch in the Virginia governor's race Buttigieg twins dress as 'twinfrastructure' for Halloween Officials, lawmakers express optimism on infrastructure, spending vote MORE that Biden is looking at every tool at his disposal to address high gas prices in the U.S.\n\nGranholm noted that Biden had already asked the Organization of the Petroleum Exporting Countries to increase supply, but it declined.\n\nADVERTISEMENT\n\n\"That is going to increase the chokehold on access to affordable fuel at the pump, and so the president is looking at all of the tools that he has,\" Granholm told Bash.\n\n“What about the Strategic Petroleum Reserve?” Bash asked Granholm.\n\n“That's one of the tools that he has, and he's certainly looking at that,” Granholm told Bash.\n\nGranholm also warned Bash that Americans will have to pay more for heating this winter due to supply chain issues caused by the COVID-19 pandemic.\n\n“We are in a slightly beneficial position, certainly relative to Europe, because their chokehold of natural gas is very significant. They're going to pay five times higher,” Granholm told Bash.\n\n\"But we have the same problem in fuels that the supply chains have, which is that the oil and gas companies are not flipping the switch as quickly as the demand requires,\" she added. \"That's why the president has been focused on both the immediate term and the long term.\"\n\nADVERTISEMENT"
        },
        {
            "source": {
                "id": null,
                "name": "NPR"
            },
            "author": "Kat Lonsdorf",
            "title": "A broken toilet on SpaceX capsule means astronauts will return to Earth in diapers - NPR",
            "description": "NASA astronaut Megan McArthur called the situation \"sub-optimal,\" but says the crew's four astronauts are \"prepared to deal with it.\" They will return home after spending nearly 200 days in space.",
            "url": "https://www.npr.org/2021/11/07/1053383188/a-broken-toilet-on-spacex-capsule-means-astronauts-will-return-to-earth-in-diape",
            "urlToImage": "https://media.npr.org/assets/img/2021/11/07/ap21113269514287_wide-f526f6fae44ca7ec728eaec08dadfd10adbec16b.jpg?s=1400",
            "publishedAt": "2021-11-08T00:34:08Z",
            "content": "The Crew Dragon space capsule astronauts, from front left, European Space Agency astronaut Thomas Pesquet, NASA astronaut Megan McArthur, NASA astronaut Shane Kimbrough and Japan Aerospace Exploratio… [+2604 chars]",
            "full_content": "A broken toilet on SpaceX capsule means astronauts will return to Earth in diapers\n\nEnlarge this image toggle caption John Raoux/AP John Raoux/AP\n\nThe journey back to Earth from space is never easy, but the astronauts aboard the SpaceX capsule coming home Monday will have an extra challenge to deal with: no working toilet. The four members on SpaceX Crew Dragon Endeavor will be wearing diapers as they splash down, in order to prevent anything else from splashing too.\n\nThe crew for this mission, known as Crew-2, has been at the International Space Station since April, and have spent nearly 200 days in space. \"It's been a very, very intense mission, a lot of things have happened,\" said expedition commander and French astronaut Thomas Pesquet in a press conference over the weekend. Over the mission, they conducted a series of spacewalks installing solar panels to upgrade the station's powergrid, grew the first green chile peppers in space (and made tacos!) and even hosted a private Russian film crew.\n\nThe SpaceX capsule is currently scheduled to undock from the International Space Station on Monday afternoon and return Monday night, although all of that is dependent on the weather. All in all, the four crew members could spend up to 20 hours in the capsule, from the time the hatches are closed until they open again on Earth.\n\nIn this weekend's press conference, NASA astronaut Megan McArthur confirmed that the toilets on board Dragon Endeavor are broken. \"Of course that's sub-optimal, but we're prepared to manage,\" she said with a smile. \"Space flight is full of lots of little challenges, this is just one more that we'll encounter and take care of in our mission.\"\n\nThis is not the first toilet issue on a SpaceX Dragon capsule. An alarm went off on SpaceX's all-tourist flight earlier this year, signaling a problem with the onboard waste management system. Bill Gerstenmaier, a vice president at SpaceX, later said in a press conference that the spacecraft's urine storage system had become disconnected in flight, allowing pooled urine to enter a fan system. It didn't cause any major problems on that flight.\n\nA similar problem was then found on Crew-2's capsule, which is why it has been taken offline for this return journey home. NASA and SpaceX engineers say they did extensive tests to make sure that the urine leak from April, when the crew was last in the Dragon capsule, would not have harmed the spacecraft over time.\n\nA new SpaceX mission, Crew-3, is set to launch no earlier than Wednesday to continue the work of Crew-2. Gerstenmaier, who was a longtime NASA engineer before joining SpaceX, says that the toilet problem has been fixed for the upcoming launch."
        },
        {
            "source": {
                "id": null,
                "name": "KSL.com"
            },
            "author": "David Shepardson, Reuters",
            "title": "US braces for surge of vaccinated international travelers - KSL.com",
            "description": "The United States is expecting a flood of international visitors crossing its borders by air and by land on Monday after lifting travel restrictions for much of the world's population.",
            "url": "https://www.ksl.com/article/50278329/us-braces-for-surge-of-vaccinated-international-travelers",
            "urlToImage": "https://img.ksl.com/slc/2849/284949/28494908.jpeg?filter=kslv2/responsive_story_lg",
            "publishedAt": "2021-11-08T00:27:02Z",
            "content": "Estimated read time: 5-6 minutes\r\nWASHINGTON The United States is expecting a flood of international visitors crossing its borders by air and by land on Monday after lifting travel restrictions for m… [+5728 chars]",
            "full_content": "Travelers wearing protective face masks to prevent the spread of the coronavirus disease reclaim their luggage at the airport in Denver, Nov. 24, 2020. The United States is expecting a flood of international visitors crossing its borders by air and by land on Monday after lifting travel restrictions for much of the world's population. (Kevin Mohatt, Reuters)\n\nEstimated read time: 5-6 minutes\n\nWASHINGTON — The United States is expecting a flood of international visitors crossing its borders by air and by land on Monday after lifting travel restrictions for much of the world's population first imposed in early 2020 to address the spread of COVID-19.\n\nUnited Airlines is expecting about 50% more total international inbound passengers Monday compared to last Monday when it had about 20,000.\n\nAnd Delta Air Lines Chief Executive Ed Bastian has warned travelers should be prepared for initial long lines.\n\n\"It's going to be a bit sloppy at first. I can assure you, there will be lines, unfortunately,\" Bastian said, adding that \"we'll get it sorted out\".\n\nDelta said in the six weeks since the U.S reopening was announced it has seen a 450% increase in international point-of-sale bookings versus the six weeks prior to the announcement.\n\nWhite House spokesman Kevin Munoz said on Twitter \"As we expect high demand when the U.S. lifts its existing air and land travel restrictions Monday, we are taking critical steps to be prepared by providing additional resources.\"\n\nThe Biden administration has held multiple calls with U.S. airlines to prepare for the influx of additional travelers that will begin arriving at U.S. airports and has warned travelers crossing from Canada and Mexico by land or ferry to be prepared for longer waits starting Monday.\n\nFor Bhavna Patel, a flight from London will take her to New York on Monday to see her first grandchild after more than a year of watching him grow via FaceTime.\n\nThe rules have barred most non-U.S. citizens who within the prior 14 days have been in 33 countries — the 26 Schengen countries in Europe without border controls, China, India, South Africa, Iran, Brazil, Britain and Ireland.\n\nTrade group U.S. Travel said the countries accounted for 53% of all overseas visitors to the United States in 2019 and border communities were hit hard by the loss of tourists crossing from Mexico and Canada. The group estimates declines in international visitation \"resulted in nearly $300 billion in lost export income\" since March 2020.\n\nU.S. airlines are boosting flights to Europe and other destinations that were impacted by the restrictions. Airlines are planning events on Monday with executives meeting some of the first flights.\n\nCommerce Secretary Gina Raimondo and United Airlines President Brett Hart are holding an event at Chicago's O'Hare International Airport Monday to mark the reopening.\n\nU.S. officials plan an Instagram live chat on Nov. 9 to help answer questions.\n\nMany international flights are expected to operate close to full or full on Monday, with high passenger volume throughout the following weeks.\n\nWhat travelers to the US need to know\n\nThe Biden administration's new rules requiring most foreign nationals to be vaccinated before flying to the United States take effect at 12:01 a.m. EST on Nov. 8.\n\nPassengers will need to show an \"official source\" showing vaccination status, and airlines will need to match the name and date of birth to confirm the passenger is the same person reflected on the proof of vaccination.\n\nThe U.S. Centers for Disease Control and Prevention has said it will accept U.S. Food and Drug Administration approved or authorized and World Health Organization emergency use listed vaccines.\n\nAll travelers must produce a negative viral test result within three days prior to travel to the United States. Unvaccinated U.S. citizens and others getting exemptions must provide a negative test taken within one day before traveling.\n\nChildren under 18 are excepted from the vaccination requirement but children between the ages of 2 and 17 are required to take a pre-departure test. Unvaccinated foreign nationals under 18 will not have to self-quarantine upon arrival. Non-tourist travelers from nearly 50 countries with nationwide vaccination rates of less than 10% will also be eligible for exemption.\n\nIf traveling with a fully vaccinated adult, an unvaccinated child can test three days prior to departure, but if an unvaccinated child is traveling alone or with unvaccinated adults, they will have to test within one day before departure. Exemptions include certain COVID-19 vaccine clinical trial participants, those with valid medical reasons for not getting vaccinated and those who need to travel for emergency or humanitarian reasons, but they will need a U.S. government-issued letter affirming the urgent need to travel.\n\nThe CDC said there are no exceptions for the vaccine requirements \"for religious reasons or other moral convictions.\"\n\nNon-tourist travelers from nearly 50 countries with nationwide vaccination rates of less than 10% will be exempt from the requirements but must agree within 60 days to get vaccinated under most conditions. Travelers must sign an attestation that they have been vaccinated and are warned that \"willfully providing false or misleading information may lead to criminal fines and imprisonment.\"\n\nThe Transportation Security Administration plans to issue a security directive that provides the legal basis for airlines to check vaccine records. The CDC also issued a Contact Tracing Order that requires all airlines flying into the United States to collect and keep on hand for 30 days and disclose to the CDC if needed contact information including phone numbers, email and U.S. addresses that will allow health officials to track infections. The collection requirements take effect Nov. 8.\n\nThe CDC released a travel assessment tool on Monday for people planning international trips, including an extensive question and answer section for travelers.\n\nAlso Monday, new contact tracing rules will take effect requiring airlines to collect information from international air passengers if needed \"to follow up with travelers who have been exposed to COVID-19 variants or other pathogens.\"\n\n×\n\nRelated Stories"
        },
        {
            "source": {
                "id": null,
                "name": "The Guardian"
            },
            "author": "Guardian staff reporter",
            "title": "Josh Allen sacks and intercepts Josh Allen as Jaguars shock Bills - The Guardian",
            "description": "Jacksonville had the better Josh Allen on Sunday, with the standout linebacker intercepting a pass, making a sack and recovering a fumble against his namesake",
            "url": "https://amp.theguardian.com/sport/2021/nov/07/josh-allen-sacks-josh-allen-as-jaguars-shock-bills",
            "urlToImage": null,
            "publishedAt": "2021-11-08T00:22:00Z",
            "content": "NFL<ul><li>Linebacker brings down namesake QB in surprise victory</li><li>Browns win first game since departure of Odell Beckham</li><li>Broncos get upset win over high-flying Cowboys</li></ul>\r\nJack… [+7832 chars]",
            "full_content": "Show caption Jacksonville Jaguars linebacker Josh Allen (41) sacks Buffalo Bills quarterback Josh Allen (17). Photograph: Phelan M Ebenhack/AP NFL Josh Allen sacks and intercepts Josh Allen as Jaguars shock Bills Linebacker brings down namesake QB in surprise victory\n\nBrowns win first game since departure of Odell Beckham\n\nBroncos get upset win over high-flying Cowboys Agencies Sun 7 Nov 2021 21.58 GMT Share on Facebook\n\nShare on Twitter\n\nShare via Email\n\nJacksonville had the better Josh Allen on Sunday, with the standout linebacker intercepting a pass, making a sack and recovering a fumble in a 9-6 upset of the Buffalo Bills.\n\nHis namesake, the Buffalo quarterback, turned over the ball three times, including twice in the second half. He didn’t have a second-half turnover in any previous game this season. The Bills (5-3) lost for the second time in seven games. The Jaguars (2-6) rebounded from a debacle at Seattle a week ago.\n\nBuffalo’s Allen completed 31 of 47 passes for 264 yards, with the two interceptions and a fumble.\n\nThe first of two deciding moments came on a third-and-two play at the Jaguars 37 with just over five minutes remaining. Allen fumbled after getting pressured by Dawuane Smoot. The other Josh Allen recovered. Buffalo got the ball back in the waning minutes and advanced to the Jaguars’ 39. But Smoot sacked Allen on third down. It was Jacksonville’s fourth sack of the day. Allen got the first one.\n\nIt was the first time a player sacked a quarterback with the same name since the NFL started counting sacks in 1982.\n\nGreen Bay Packers 7-13 Kansas City Chiefs\n\nPatrick Mahomes threw for 166 yards and a touchdown, Kansas City relentlessly blitzed the Packers’ Jordan Love in his highly anticipated first start in place of Aaron Rodgers, and the Chiefs held off Green Bay 13-7.\n\nRodgers tested positive for Covid-19 earlier this week, forcing the reigning MVP to miss his first game since the 2017 season. Love responded by going 19 of 34 for 190 yards with a touchdown and an interception, both of them coming in the fourth quarter when the Packers were trying to rally from a 13-0 deficit against the defending AFC champs.\n\nCleveland Browns 41-16 Cincinnati Bengals\n\nBaker Mayfield threw two touchdown passes, Nick Chubb ran for 137 yards and the Cleveland Browns, sparked by cornerback Denzel Ward’s early 99-yard interception return for a TD, capped a chaotic week by smashing Joe Burrow and the Cincinnati Bengals.\n\nThe Browns (5-4) came in desperate for a win after dropping three of four. Their situation turned dramatic on Wednesday when star wide receiver Odell Beckham Jr was exiled for poor behavior and the team decided to release him.\n\nBut like last year, when Mayfield played more freely after Beckham suffered a season-ending knee injury, Cleveland’s QB was on target and the Browns put together their most complete game this season to humble the Bengals (5-4), who hurt themselves with mistakes as they dropped their second straight.\n\nLos Angeles Chargers 27–24 Philadelphia Eagles\n\nJustin Herbert threw two touchdown passes and ran for a score, and Dustin Hopkins kicked a 29-yard field goal with two seconds remaining, leading the Los Angeles Chargers to a 27-24 victory over the Philadelphia Eagles.\n\nHerbert threw for 356 yards, completing 32 of 38 passes. He got one-yard on a sneak on fourth-and-one from the Eagles 28 with 1:45 left, setting up Hopkins’ kick. The Chargers (5-3) snapped a two-game losing streak. The Eagles (3-6) still haven’t won a home game in four tries under rookie coach Nick Sirianni.\n\nArizona Cardinals 31–17 San Francisco 49ers\n\nJames Conner ran for two touchdowns and caught a 45-yard TD pass from backup quarterback Colt McCoy as the short-handed Arizona Cardinals beat the San Francisco 49ers.\n\nThe Cardinals (8-1) were playing without quarterback Kyler Murray and receivers DeAndre Hopkins and AJ Green but still had little trouble completing the season sweep against the 49ers (3-5). Conner scored on TD runs on back-to-back drives in the first quarter to stake the Cardinals to a big lead they never relinquished. Conner’s long catch-and-run TD on Arizona’s first drive of the second half helped put the game out of reach.\n\nDenver Broncos 30–16 Dallas Cowboys\n\nTeddy Bridgewater threw for a touchdown and had a sneak for another, and the Denver Broncos stymied the NFL’s No 1 offense when it mattered in a 30-16 victory over Dallas, ending the Cowboys’ six-game winning streak.\n\nDak Prescott returned after missing a game with a strained right calf but couldn’t get the Cowboys (6-2) moving until two meaningless late touchdowns that merely avoided what would have been their worst shutout loss at home since 1985.\n\nNew England Patriots 24–6 Carolina Panthers\n\nMac Jones overcame two early turnovers and threw for 139 yards and a touchdown, JC Jackson returned one of three Sam Darnold interceptions for an 88-yard touchdown and the New England Patriots defeated the Carolina Panthers for their fourth win in the past five games.\n\nRookie running back Rhamondre Stevenson had 106 yards from scrimmage before leaving the game with a head injury and Damien Harris and Hunter Henry scored touchdowns as the Patriots (5-4) improved to 4-0 on the road.\n\nDarnold had another miserable outing for Carolina. He finished 16 of 33 for 172 yards with three picks, two of them by Jackson after the Panthers (4-5) reached the red zone. Darnold has been intercepted nine times and thrown only one touchdown in four career games against the Bill Belichick-coached Patriots.\n\nMinnesota Vikings 31–34 Baltimore Ravens\n\nJustin Tucker kicked a 36-yard field goal with 16 seconds left in overtime to give the Baltimore Ravens a 34-31 victory over the Minnesota Vikings.\n\nThe AFC North-leading Ravens (6-2) rallied from a 14-point third-quarter deficit and survived an acrobatic interception by Minnesota’s Anthony Barr on the first possession of overtime. Barr tipped Lamar Jackson’s pass and caught it out of the air, giving the Vikings the ball at their own 38, but Minnesota went three-and-out, and Baltimore drove into Tucker’s range again.\n\nLas Vegas Raiders 16–23 New York Giants\n\nXavier McKinney returned an interception 41 yards for a touchdown early in the second half and picked off another errant throw by Derek Carr late as the New York Giants added to the Raiders’ post-bye woes with a 23-16 victory over Las Vegas.\n\nDaniel Jones threw a 30-yard touchdown pass to Evan Engram and Graham Gano added three field goals the last after McKinney’s second pick for New York (3-6). Filling in for the injured Saquon Barkley, former Raider Devontae Booker ran for 99 yards before leaving late with a hip injury.\n\nAtlanta Falcons 27–25 New Orleans Saints\n\nMatt Ryan hit Cordarrelle Patterson for a 64-yard gain with a minute to go, setting up Younghoe Koo’s 29-yard field goal as time expired, and the Atlanta Falcons defeated the mistake-prone New Orleans Saints.\n\nRyan passed for 343 yards, connected twice with Olamide Zaccheaus for touchdowns, and the veteran quarterback also ran for a score on a bootleg. Ryan’s second scoring pass gave the Falcons a 24-6 lead with 10:39 left in the fourth quarter. But the Saints rallied to briefly take the lead on Trevor Siemian’s eight-yard pass to Kenny Stills with 1:01 left. New Orleans then missed a two-point conversion try for the second time in the game, leaving the door open for the Falcons.\n\nHouston Texans 9-17 Miami Dolphins\n\nIn the NFL’s most turnover-filled game in more than five seasons, the Miami Dolphins got 244 yards passing and a touchdown throw from surprise starter Jacoby Brissett on the way to beating the Houston Texans.\n\nThe game between two teams that entered with 1-7 records and both on seven-game losing streaks lived up or down to its billing. The Dolphins and Texans combined for nine turnovers. Miami had five, Houston four, and somehow the Dolphins (2-7) won anyway."
        },
        {
            "source": {
                "id": "buzzfeed",
                "name": "Buzzfeed"
            },
            "author": "[{\"@type\":\"Person\",\"name\":\"Joyann Jeffrey\",\"url\":\"https://www.buzzfeed.com/joyannjeffrey\",\"jobTitle\":\"BuzzFeed Staff\"}]",
            "title": "Vin Diesel Asked Dwayne \"The Rock\" Johnson To Return To \"The Fast And The Furious\" Franchise After They Fell Out With Each Other On Set - BuzzFeed",
            "description": "“Hobbs can’t be played by no other.\"",
            "url": "https://www.buzzfeed.com/joyannjeffrey/vin-diesel-dwayne-johnson-feud-statement",
            "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2021-11/7/23/asset/0186409ceebd/sub-buzz-10814-1636328532-1.jpg?crop=1024:536;0,147%26downsize=1250:*",
            "publishedAt": "2021-11-08T00:14:58Z",
            "content": null,
            "full_content": "“I swore that we would reach and manifest the best Fast in the finale that is 10! I say this out of love… but you must show up, do not leave the franchise idle, you have a very important role to play.”"
        },
        {
            "source": {
                "id": "associated-press",
                "name": "Associated Press"
            },
            "author": "David Sharp",
            "title": "'Nimblewill Nomad,' 83, is oldest to hike Appalachian Trail - Associated Press",
            "description": "PORTLAND, Maine (AP) — An 83-year-old from Alabama started walking when he retired more than a quarter-century ago — and never stopped. M.J. “Sunny” Eberhart strode into the record books Sunday as the oldest hiker to complete the Appalachian Trail.",
            "url": "https://apnews.com/article/lifestyle-environment-and-nature-alabama-maine-07890eda2a8dc653bb69c68629e20a8f",
            "urlToImage": "https://storage.googleapis.com/afs-prod/media/21e9cb43ac1a441798f7d80857a9b6f0/3000.jpeg",
            "publishedAt": "2021-11-07T23:53:55Z",
            "content": "PORTLAND, Maine (AP) An 83-year-old from Alabama started walking when he retired more than a quarter-century ago and never stopped.\r\nM.J. Sunny Eberhart strode into the record books Sunday as the old… [+4333 chars]",
            "full_content": "M.J. Eberhart, 83, arrives on the summit of Mount Hayes on the Appalachian Trail, Sunday, Sept. 12, 2021, in Gorham, New Hampshire. Eberhart, who goes by the trail name of Nimblewill Nomad, is the oldest person to hike the entire 2,193-mile Appalachian Trail. (AP Photo/Robert F. Bukaty)\n\nM.J. Eberhart, 83, arrives on the summit of Mount Hayes on the Appalachian Trail, Sunday, Sept. 12, 2021, in Gorham, New Hampshire. Eberhart, who goes by the trail name of Nimblewill Nomad, is the oldest person to hike the entire 2,193-mile Appalachian Trail. (AP Photo/Robert F. Bukaty)\n\nPORTLAND, Maine (AP) — An 83-year-old from Alabama started walking when he retired more than a quarter-century ago — and never stopped.\n\nM.J. “Sunny” Eberhart strode into the record books Sunday as the oldest hiker to complete the Appalachian Trail.\n\nEberhart, known by the trail name Nimblewill Nomad, acknowledged that despite having tens of thousands of miles under his belt, the trail was tough going at his age, leading to quite a few spills on slippery rocks.\n\n“I’ve a got a couple of skid marks on me, but I’m OK,” he said in a recent interview. “You’ve got to have an incredible resolve to do this.”\n\nHe hiked the trail out of order, in sections, to take advantage of optimal weather, and had already completed northern sections including Maine’s Mount Katahdin. He completed his final section in western Massachusetts, in the town of Dalton, in the same year in which a 5-year-old became among the youngest to complete the feat.\n\nADVERTISEMENT\n\nJoining Eberhart for the finish was the former record holder, Dale “Greybeard” Sanders, who lives outside Memphis, Tennessee. He completed the hike at age 82 in 2017. He’s not sad to see the record fall.\n\n“My dear friend Nimblewill is taking my record away from me, and I’m happy for him. Records are made to be broken,” Sanders said.\n\nSanders confirmed the completion of the feat as Eberhart was toasted with Champagne at a friend’s house.\n\nJordan Bowman, of the Appalachian Trail Conservancy in Harpers Ferry, West Virginia, confirmed that Eberhart is the oldest to finish the trail, surpassing Sanders.\n\nEberhart began his wanderlust in earnest after retiring as an optometrist in Florida in 1993.\n\nThe man with flowing locks and an impressive beard actually hiked farther than most who traverse the 2,193-mile (3,530-kilometer) trail that runs between Georgia’s Springer Mountain and Maine’s Katahdin. He started his hike in February at his home in Flagg Mountain, Alabama, adding hundreds of extra miles to the route.\n\nThe journey represented a modest distance, relatively speaking, for a guy who trekked 4,400 miles (7,080 kilometers) from the Florida Keys to northern Quebec, an adventure he chronicled in a book, “Ten Million Steps.” He later hiked from Newfoundland to Florida, an even greater distance. He also walked from Chicago to California on Route 66.\n\nHe said he was feeling his age on this hike. His reflexes aren’t what they once were, so he tried to limit himself to eight hours of hiking a day.\n\nBut he still got banged up.\n\nOn a recent day in New Hampshire, he took a tumble and bloodied his elbow. A hiking companion asked if he wanted to take a break.\n\nEberhart retorted, “Do you think if I complain about it it will go away?” before picking himself and pressing onward, said Odie Norman, of Huntsville, Alabama, who hiked 100 miles with Nimblewill.\n\nADVERTISEMENT\n\nEberhart’s age puts him at the opposite extreme from a pair of young hikers who completed the trail during the pandemic.\n\nA 4-year-old, Juniper Netteburg, finished her journey with her missionary parents last year, and a 5-year-old, Harvey Sutton, from Lynchburg, Virginia, completed the trail with his parents in August.\n\nEberhart actually met Sutton, known as Little Man, on the trail. The youngster “impressed the dickens out of me,” Eberhart said.\n\nEberhart hasn’t lost his desire to keep moving or to seek the sense of calm that he finds on the trail in the company of the tight-knit and diverse hiking community.\n\nHis first major hike coincided with a search for peace after lugging emotional and mental baggage that involved a divorce and losing the respect of his children, he said. He eventually found his peace, and forgiveness.\n\n“You can seek peace. That doesn’t mean that you’re going to find it. I persevered to the point that the good Lord looked down on me and said you’re forgiven, you can be at peace,” he said recently during a break near the Maine-New Hampshire border.\n\n“It’s a profound blessing. It’s as simple as that,” he said.\n\nWith the hike over, Eberhart will return to his home at Flagg Mountain, the southernmost mountain topping 1,000 feet in the Appalachians, where he serves as caretaker of a fire tower and cabins built by the Civilian Conservation Corps.\n\nNorman, who publishes “The Hiker Yearbook,” said Eberhart probably won’t hang up his boots anytime soon.\n\n“He said, ‘You know they’re calling this my final hike.’ Then he laughed,” Norman said. “I don’t think it’s going to be his last hike. I just don’t think he knows what’s he’s going to hike next.”\n\n___\n\nAssociated Press photojournalist Robert F. Bukaty contributed to this report."
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": "https://www.facebook.com/bbcnews",
            "title": "'Perfect' James Webb telescope on track for launch - BBC News",
            "description": "Engineers begin assembling the rocket that will send to orbit the successor to the Hubble telescope.",
            "url": "https://www.bbc.com/news/science-environment-59201590",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13DA5/production/_121471318_p0b2tkwh.jpg",
            "publishedAt": "2021-11-07T23:35:09Z",
            "content": "Jonathan AmosScience correspondent@BBCAmoson Twitter\r\nMedia caption, Peter Jensen: \"For Europeans the cost equates to a cheap cup of coffee drunk over 20 years\"\r\nThe successor to the Hubble Space Tel… [+4723 chars]",
            "full_content": "\"On face value there's a lot of zeroes, and Europe has spent €700m (£600m; $800m) on this mission. But when you look at it as a cost per inhabitant in Europe, it comes down to a cheap cup of coffee in a cheap cafe, drunk over a period of 20 years. And for that we get access to such a high-performance observatory that will take us on a kind of Columbus journey to an unknown period in cosmic history.\""
        },
        {
            "source": {
                "id": null,
                "name": "CNBC"
            },
            "author": "Reuters",
            "title": "Sydney Airport signs $17.5 billion buyout deal, one of the biggest buyouts ever in Australia - CNBC",
            "description": "Sydney Airport entered a scheme implementation deed for an infrastructure group to buy the airport operator for A$23.6 billion ($17.46 billion), it said Monday.",
            "url": "https://www.cnbc.com/2021/11/07/sydney-airport-signs-17point5-billion-buyout-deal-one-of-the-biggest-buyouts-ever-in-australia.html",
            "urlToImage": "https://image.cnbcfm.com/api/v1/image/106950669-1633054678474-gettyimages-1340424367-dsc_1071_2021091543415959.jpeg?v=1636325304",
            "publishedAt": "2021-11-07T22:51:51Z",
            "content": "Sydney Airport entered a scheme implementation deed for an infrastructure group to buy the airport operator for A$23.6 billion ($17.46 billion), it said on Monday, making it one of the biggest buyout… [+1122 chars]",
            "full_content": "A silent departures forecourt outside the International Terminal at Kingsford Smith Airport on September 15, 2021 in Sydney, Australia.\n\nSydney Airport Holdings said on Monday it has agreed to accept a A$23.6 billion ($17.5 billion) takeover bid from an infrastructure investor group in one of Australia's biggest buyouts.\n\nThe company said in a statement it unanimously recommended the buyout offer from Sydney Aviation Alliance (SAA), comprised of Australian investors IFM Investors, QSuper, AustralianSuper and U.S.-based Global Infrastructure Partners.\n\nThe deal to buy Australia's largest and only listed airport operator comes as the country this month eased its international border restrictions for the first since the beginning of the coronavirus pandemic.\n\nA scheme implementation deed had been made on Monday and a scheme meeting would take place in January, the company said.\n\nIt follows a sweetened offer by SAA — 6% higher than its first approach at A$8.25 — which convinced the company's board to give the consortium access to due diligence.\n\n\"The Sydney Airport Boards believe the outcome reflects appropriate long-term value for the airport, and unanimously recommend the proposal,\" Chairman David Gonski said."
        },
        {
            "source": {
                "id": null,
                "name": "Daily Mail"
            },
            "author": "Sarah Abraham",
            "title": "Kanye West 'has been dating 22-year-old model Vinetria for a while now' - Daily Mail",
            "description": "Kanye West has reportedly been romancing 22-year-old model Venetria 'for a while now' despite sharing this week that Kim Kardashian was 'still my wife' and expressing hope of reconciliation",
            "url": "https://www.dailymail.co.uk/tvshowbiz/article-10175675/Kanye-West-dating-22-year-old-model-Vinetria-now.html",
            "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/07/23/50184293-0-image-a-31_1636328236205.jpg",
            "publishedAt": "2021-11-07T22:49:09Z",
            "content": "Kanye West has reportedly been romancing a 22-year-old model by the name of Vinetria 'for a while now.' \r\nAccording to Page Six, 'Ye' has been 'hooking up' with the model but no timeline was given of… [+4995 chars]",
            "full_content": "Kanye West has reportedly been romancing a 22-year-old model by the name of Vinetria 'for a while now.'\n\nAccording to Page Six, Ye has been 'hooking up' with the model but no timeline was given of when their relationship officially started.\n\nWest and Vinetria took the romance public this weekend as they attended his Donda Academy's debut basketball game in Minneapolis, where they were photographed courtside.\n\n\n\nThe rumored duo looked very much like a couple as they sat side by side at his Donda basketball game in Minnesota on Saturday evening.\n\nVinetria was also reportedly with the rapper in Miami last month when he filmed his Drink Champs interview (though it was only released on November 4), during which he said Kim Kardashian 'is still my wife' and added that he had not seen any divorce papers.\n\nContinuing to take their romance nationwide, the model was in attendance at his October 31 Sunday Service, and shared footage to her Instagram.\n\nNew romance! Kanye West has reportedly been hooking up with a 22-year-old model by the name of Vinetria 'for a while now'; pictured September 22\n\nStunning: The duo went public with their romance at his Donda Academy's debut basketball game in Minneapolis this weekend where they were photographed courtside\n\nHolding out hope: Ye said in a recent Drink Champs interview (which Vinetria was in attendance for) that Kim Kardashian 'is still my wife' and said he had not seen any divorce papers; pictured October 23\n\nHis romance with Vinetria comes just months after he was linked to supermodel Irina Shayk beginning in March — just one month after Kardashian filed for divorce after seven years of marriage.\n\nTheir romance lasted until August, with a PEOPLE source saying that 'it was never a serious thing that took off,' and that West did not have bandwidth to be dating.\n\nKim on the other hand has been romantically linked to SNL funnyman Pete Davidson, 27, in recent weeks and was said to have spent two evenings with Davidson last week during a trip to New York City.\n\nOn the evening of November 2, he reportedly romanced her at his go-to Italian spot Campania's in his native Staten Island where he 'arranged a dinner on the rooftop privately' for 'just the two of them,' and the next night they were photographed at Zero Bond.\n\nSultry: The not much is known about the model or how she and West came to be, she frequently shares sultry snaps to her Instagram; pictured in bathtub snap on November 1\n\nSunday Service: The model was in attendance at his Sunday Services last weekend and shared video footage to her Instagram; October 31\n\nOne source said that the pair had 'chemistry' and that overall Kim was 'intrigued' by Pete, with another saying she totally understands 'the fuss' about the lanky comedian.\n\nA source told DailyMail.com that Davidson is 'very aggressive' with her as he often 'grabs her waist, compliments her butt and touches her hair' when they are together.\n\n'He is making it crystal clear he likes her,' the confidant said. 'He definitely is not being aloof or playing coy, he is just going for it. And she seems to be loving the attention. It's nice to see her happy.'\n\nAmid the reports of romance with Pete, West unfollowed Kim on Instagram with sources saying that her mega-famous family was 'worried' how Ye would react to the SKIMS founder dating.\n\nHoping to rekindle: 'Everybody in the family is worried about how Kanye will react to Kim spending so much time with Pete,' an insider told Page Six, as West had made it clear he 'still wants to be with her'; pictured February 2020\n\nDate night! On November 3 Kim was seen entering Zero Bond where she dined with Pete for the second night in a row, following their romantic rooftop date at Campania's in Staten Island\n\nAll in! A source told DailyMail.com that Davidson is 'very aggressive' with her as he often 'grabs her waist, compliments her butt and touches her hair' when they are together and that 'he is making it crystal clear he likes her'; pictured October 20\n\n'Everybody in the family is worried about how Kanye will react to Kim spending so much time with Pete,' an insider told Page Six. 'Kanye recently said he still wants to be with her, so he can't be taking this well.'\n\nAn Us Weekly insider divulged that Kim had actually sought out advice on dating the comedian from her friends and family and they 'encouraged' it.\n\n'One of the first things Kim did was to get her family and friends' advice, and they all encouraged her to go for it. It's been very obvious for a while now that she's been missing some fun and laughter in her life, and of course Pete offers that in abundance.'\n\nOn Thursday November 4, the Donda rapper opened up about his situation with Kim where he repeatedly referred to her as 'my wife' (in the present tense) during an appearance on Drink Champs.\n\n'SNL making my wife say, \"I divorced him\" on TV because they just wanted to get that bar off. And I ain't never even seen the papers; we're not even divorced. That ain't no joke to me. My kids want their parents to stay together. I want ... us to be together.'"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Jon Brown",
            "title": "Biden admin considering shutting down another pipeline, drawing criticism and dire warnings as winter nears - Fox News",
            "description": "The Biden administration is reportedly weighing the potential market consequences of shutting down an oil pipeline in Michigan, drawing criticism from opponents.",
            "url": "https://www.foxnews.com/politics/biden-admin-considering-shutting-down-michigan-pipeline",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/biden-pipeline.jpg",
            "publishedAt": "2021-11-07T22:34:48Z",
            "content": "The Biden administration is reportedly weighing the potential market consequences of shutting down an oil pipeline in Michigan, drawing criticism from opponents. Former Michigan Gov. Jennifer Granhol… [+3867 chars]",
            "full_content": "The Biden administration is reportedly weighing the potential market consequences of shutting down an oil pipeline in Michigan, drawing criticism from opponents. Former Michigan Gov. Jennifer Granholm, Biden's energy secretary, predicted Sunday that heating prices will rise this winter regardless of the Biden administration's decision on the pipeline. \"Yeah, this is going to happen. It will be more expensive this year than last year,\" Granholm told CNN.\n\nBIDEN ENERGY SEC. GRANHOLM LAUGHS AT QUESTION ABOUT BOOSTING OIL PRODUCTION\n\nThe administration has yet to decide on what to do with Line 5 and officials were gathering information only to present a clear picture of the situation, according to sources who spoke to Politico.\n\nLine 5 is part of a network that moves crude oil and other petroleum products from western Canada, transporting about 540,000 barrels per day. Petroleum is taken from the pipeline in Escanaba, Michigan.\n\nJason Hayes, the director of environmental policy at the Mackinac Center for Public Policy, blasted the Biden administration for its energy policies, telling Fox News that their work on Line 5 is \"just one more example of being divorced from reality.\"\n\nMICHIGAN GOV. GRETCHEN WHITMER LOOKING TO SHUT DOWN ENBRIDGE PIPELINE DURING NATIONAL GAS SHORTAGE\n\n\"They're planning to power an industrial nation like the United States on solar panels and wind turbines,\" Hayes said, while noting that even the solar panels and wind turbines require \"oil, natural gas, nuclear and even coal\" to be produced.\n\nHayes presented a dire picture of what shutting Line 5 could mean if people are unable to get natural gas or the electricity it provides as the nation heads into winter.\n\n\"I hope it doesn't end like this, but where I see it going is unfortunately the same thing that happened in February in Texas: People freezing in their homes,\" he said, adding, \"Most of the time when it's extremely cold or there's a real bad polar vortex situation, typically it's pretty cloudy and there's not a lot of wind.\"\n\nExplaining he has trouble understanding why some Western leaders seem unable to grasp the importance of reliable, affordable energy and electricity for everyday citizens, Hayes said, \"It seems like the only nations that understand that we require reliable, affordable dispatchable energy is China and Russia. And they're the only ones that are producing energy and they're more than happy to hold that energy hostage for the rest of the world.\"\n\nBIDEN FAILS TO ACHIEVE UNITY ON CLIMATE AS CHINA, RUSSIA AVOID COP26 SUMMIT\n\nThe Biden administration's move on Line 5 has drawn criticism from Republican lawmakers in Congress, more than a dozen of whom sent a letter to Biden on Nov. 4 warning against such a move as gas prices surge 50%.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRep. Bob Latta, R-Ohio, wrote, \"As we enter the winter months and temperatures drop across the Midwest, the termination of Line 5 will undoubtedly further exacerbate shortages and price increases in home heating fuels like natural gas and propane at a time when Americans are already facing rapidly rising energy prices, steep home heating costs, global supply shortages, and skyrocketing gas prices.\"\n\nThe Biden administration canceled the Keystone XL pipeline in January, but has since waived sanctions against a pipeline for Russia to ship energy to Germany, effectively approving that pipeline.\n\nFox News' Angelica Stabile contributed to this report."
        },
        {
            "source": {
                "id": "the-hill",
                "name": "The Hill"
            },
            "author": "Caroline Vakil",
            "title": "Trump bashes Senate Republicans, McConnell over bipartisan infrastructure bill | TheHill - The Hill",
            "description": "Former President Trump on Sunday doubled down on his criticism of...",
            "url": "https://thehill.com/homenews/administration/580471-trump-bashes-moderate-republicans-mcconnell-over-bipartisan",
            "urlToImage": "https://thehill.com/sites/default/files/trumpmcconnell_midterms_051818getty.jpg",
            "publishedAt": "2021-11-07T22:02:30Z",
            "content": "Former President TrumpDonald TrumpIsraeli officials say US should open consulate for Palestinians in West BankVirginia loss lays bare Democrats' struggle with rural votersSunday shows preview: House … [+2605 chars]",
            "full_content": "Former President Trump Donald TrumpIsraeli officials say US should open consulate for Palestinians in West Bank Virginia loss lays bare Democrats' struggle with rural voters Sunday shows preview: House passes bipartisan infrastructure bill; Democrats suffer election loss in Virginia MORE on Sunday doubled down on his criticism of Senate Minority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellHouse passes trillion infrastructure bill, advances social spending plan Democrats are getting pummeled while they're down — it's time to punch back Good Republicans in government may be Democracy's last hope MORE (R-Ky.) and other Senate Republicans who voted in favor of passing a $1.2 trillion bipartisan infrastructure bill.\n\n“All Republicans who voted for Democrat longevity should be ashamed of themselves, in particular Mitch McConnell, for granting a two month stay which allowed the Democrats time to work things out at our Country’s, and the Republican Party’s, expense!” Trump said in a statement.\n\nThe former president called Republican lawmakers who voted in favor of the bill “RINOs” — a widely used term he favors that means “Republicans in name only.” Trump suggested that Democrats would take advantage of Republicans by enlisting their support to pass their $1.75 trillion social spending bill.\n\nADVERTISEMENT\n\n“How about all of those Republican Senators that voted thinking that helping the Democrats is such a wonderful thing to do, so politically correct. They just don’t get it!” Trump said.\n\nOn Friday, House Democrats finally managed to vote on the bipartisan infrastructure bill by a 228-206 tally to send a $1.2 trillion bipartisan infrastructure bill to President Biden Joe BidenVirginia loss lays bare Democrats' struggle with rural voters After victory, Biden seeks political rebound Sunday shows preview: House passes bipartisan infrastructure bill; Democrats suffer election loss in Virginia MORE’s desk. Three Democratic caucuses negotiated a deal that also passed a procedural rule that would tee up a future vote on Democrats’ social spending bill.\n\nTrump's targeting of Senate Republicans comes after the chamber passed the infrastructure bill in a 69-30 vote that included 19 GOP senators, including McConnell.\n\nThe House vote also included the support of 13 Republicans but not six progressive Democrats.\n\nHours before the Senate was poised to vote on ending debate on the infrastructure bill in August, Trump again bashed McConnell and other Republican lawmakers for supporting the bill. Trump also said that he could use their support of the legislation as a weapon for future endorsements.\n\n“Joe Biden’s infrastructure bill is a disgrace,” Trump wrote at the time. “If Mitch McConnell was smart, which we’ve seen no evidence of, he would use the debt ceiling card to negotiate a good infrastructure package.”"
        },
        {
            "source": {
                "id": "the-verge",
                "name": "The Verge"
            },
            "author": "Emma Roth",
            "title": "Google explains why the Pixel 6’s fingerprint scanner may be sluggish - The Verge",
            "description": "Since the release of the Pixel 6 lineup, users have been complaining about the phone’s seemingly faulty fingerprint sensor. Google has finally replied to users’ complaints, and said that the issue may be caused by the sensor's “enhanced security algorithms.”",
            "url": "https://www.theverge.com/2021/11/7/22768853/google-explains-pixel-6-fingerprint-scanner-unreliable",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/kQgsiceFg9SAMYp-wFO-rqm30uY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22868042/pixel6.jpg",
            "publishedAt": "2021-11-07T21:41:01Z",
            "content": "Google says enhanced security algorithms may cause issues with the scanner\r\nGoogle\r\nTheres a lot to rave about with the Google Pixel 6 and 6 Pro, but their fingerprint scanners are not among those th… [+2208 chars]",
            "full_content": "There’s a lot to rave about with the Google Pixel 6 and 6 Pro, but their fingerprint scanners are not among those things. Since the Pixel 6 release in October, users have been complaining about its sluggish, unreliable fingerprint scanner that makes the phone a hassle to unlock. Google has finally responded to those complaints, and while it provided an explanation, it didn’t really offer any solid solution (via Engadget).\n\nWe're sorry for the hassle. The Pixel 6 fingerprint sensor utilizes enhanced security algorithms. In some instances, these added protections can take longer to verify or require more direct contact with the sensor. Try troubleshooting steps: https://t.co/uTbifE5Uyo. Thanks. ^Levi — Made By Google (@madebygoogle) November 6, 2021\n\nIn a reply on Twitter, Google attributes the issue to the “enhanced security algorithms” that the Pixel 6’s fingerprint scanner uses. Google says that these security measures can make your fingerprint “take longer to verify or require more direct contact with the sensor.” It then provides a link to a Google support page that really doesn’t offer much help, besides suggesting to ensure your fingers are clean and that you’re using a finger that you’ve registered with the phone.\n\nReplies from other Twitter users suggest that it may be a hardware issue. The Pixel 6 uses an under-the-screen optical fingerprint scanner instead of a fast ultrasonic one like the Samsung Galaxy S21, which some users say could be the reason behind the sensor’s poor performance. But as noted by Engadget, other users on Reddit say that the optical fingerprint scanner works fine on their OnePlus phones, possibly indicating a software issue specific to the Pixel 6.\n\nFor now, it looks like there’s no clear solution to the Pixel 6’s finicky fingerprint scanner, and Google’s answer is vague at best. There’s no telling whether Google can patch the issue in a software update, or if the scanner’s so-called “enhanced” security system really is picky when it comes to prints. The Verge reached out to Google with a request for comment but didn’t immediately hear back.\n\nUntil Google decides to resurrect face unlock, which had its own security flaws, you’ll just have to resort to typing in your PIN. Otherwise, the Pixel 6 will test your patience as you try to scan your fingerprint over and over again."
        },
        {
            "source": {
                "id": "the-washington-post",
                "name": "The Washington Post"
            },
            "author": "Brady Dennis, Sarah Kaplan",
            "title": "COP26 climate summit shifts from pomp and promises to difficult negotiations - The Washington Post",
            "description": "The second week is about hammering out an agreement on what nations will do together to combat global warming — and how.",
            "url": "https://www.washingtonpost.com/climate-environment/2021/11/07/cop26-climate-glasgow-negotiations/",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/11-04-2021/t_865f1ac02ace40f6b47668842f3b7787_name_Thumbnail.jpg&w=1440",
            "publishedAt": "2021-11-07T21:19:06Z",
            "content": "COP26 President Alok Sharma, striving to make Glasgow a success, urged delegates that it was the time to shift the mode of work and enter a more political, high-level phase of the conference.\r\nStory … [+10251 chars]",
            "full_content": "“As the negotiators huddle in smaller groups trying to thrash out agreement on technical issues and specific words, so the world outside the negotiating rooms will become more and more frustrated if they fear an agreement that doesn’t represent the urgency young people feel and match the anxiety that climate policy experts feel,” Rachel Kyte, dean of the Fletcher School at Tufts University, said in an email. “The next week will be tense, but has to be productive.”"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Lindsay Kornick",
            "title": "Twitter reacts to CNN's Sesame Street town hall on COVID vaccines: 'Government propaganda' - Fox News",
            "description": "Twitter users called out CNN’s use of popular Sesame Street characters to promote COVID-19 vaccinations for children.",
            "url": "https://www.foxnews.com/media/twitter-calls-out-cnn-sesame-street-town-hall-for-covid-vaccines",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/BigBird1.jpg",
            "publishedAt": "2021-11-07T21:11:09Z",
            "content": "Plenty of Twitter users uttered some less-than-family-friendly words after Sesame Street characters began promoting coronavirusvaccines on social media and CNN. \r\nOn Saturday, CNNs Erica Hill and Dr.… [+3114 chars]",
            "full_content": "Plenty of Twitter users uttered some less-than-family-friendly words after Sesame Street characters began promoting coronavirus vaccines on social media and CNN.\n\nOn Saturday, CNN’s Erica Hill and Dr. Sanjay Gupta hosted a virtual town hall featuring various characters from the long-running PBS children’s series \"Sesame Street.\"\n\nUNVACCINATED CALIFORNIA HURSE, BREASTFEEDING MOTHER FORCED OUT OVER MANDATE: ‘I HAD TO TAKE A STAND’\n\nThis followed the recent announcement from the FDA last month that approved of children ages 5-11 receiving a kid-sized version of the Pfizer/BioNTech vaccine.\n\nThe CNN town hall was promoted not only by the network and its journalists, but the characters as well. Big Bird’s Twitter account read, \"I got the COVID-19 vaccine today! My wing is feeling a little sore, but it'll give my body an extra protective boost that keeps me and others healthy. Ms. @EricaRHill even said I’ve been getting vaccines since I was a little bird. I had no idea!\"\n\nThe account for Elmo also wrote, \"Elmo was so happy to talk to @DrSanjayGupta at the town hall today! Elmo learned that Elmo's friends can get the COVID-19 vaccine now, and soon Elmo can too!\"\n\nPFIZER SAYS ITS COVID-19 VACCINE MORE THAN 90% EFFECTIVE IN KIDS\n\nVarious conservative Twitter users accused CNN of using Sesame Street characters as a form of propaganda to push COVID-19 vaccinations on children.\n\nFox News columnist Karol Markowicz tweeted, \"I called it yesterday on Tucker Carlson Tonight with @willcain that Big Bird was going to get canceled so fast unless he gets vaxxed. Elmo, you're next.\"\n\nTexas Sen. Ted Cruz tweeted, \"Government propaganda…for your 5 year old!\"\n\nPolitical commentator Stephen L. Miller wrote, \"You're not real and can't catch Covid.\"\n\nCNN previously featured Sesame Street characters in a town hall called \"Coming Together: Standing Up to Racism\" back in June 2020. That virtual town hall was also hosted by Erica Hill, along with CNN journalist Van Jones.\n\nVarious users referenced the incident in October when podcast host Joe Rogan called out Gupta for his network framing taking ivermectin for his COVID-19 treatment as ingesting \"horse dewormer.\"\n\n\"Does it bother you that the network you work for out and out lied, just outright lied about me taking horse dewormer?\" Rogan grilled Gupta.\n\n\"They shouldn't have said that,\" Gupta admitted.\n\nGupta later also admitted that Rogan did not take horse dewormer.\n\nFox News’ Joseph Wulfsohn contributed to this report.\n\nCLICK HERE TO GET THE FOX NEWS APP"
        }
    ]
}